import { MyProfileContainer, ProfileTextContainer } from "./MyProfile.style";

export default function MyProfile() {
  return (
    <MyProfileContainer>
      <ProfileTextContainer>
        <p>
          <span>국민주권당</span>은 대한민국 권력을 장악한 기득권세력의 반국민적
          사대매국 정치에 맞서 국민주권을 실현하기 위한 민주적이고 애국적인
          정당입니다.
          <br /> <br />
          <span>국민주권당</span>은 수구기득권적폐 청산과 철저한 민주개혁, 국익
          우선의 자주외교, 평화 번영 통일로 나아갑니다. 무한 경쟁과 약육강식,
          극단적인 불평등 사회를 극복하고 ‘홍익인간’의 정신으로 함께 사는 공동체
          사회를 추구합니다. <br /> <br />
          <span>국민주권당</span>은 전 지구적 문제인 기후위기를 극복하기 위한
          활동에 적극 나서며 상호존중과 호혜의 원칙에 따라 평화로운 국제질서를
          구축하는데 기여할 것입니다. <br /> <br />
          <span>국민주권당</span>은 당의 주인이 당원임을 명확히 하여 당원들이
          1인1표로 당의 주요 정책과 노선을 결정하고 국회의원 후보와 주요
          당직자들 직접 선출합니다. 정당 민주화의 기준이 되도록 하겠습니다.
          <br /> <br />
          <span>국민주권당</span>은 윤석열 퇴진을 위해 총력을 기울일 것입니다.
          먼저, 윤석열 탄핵에 앞장서겠습니다. 윤석열을 몰아내는 것이 모든 개혁의
          첫걸음입니다. 또한, 국힘당을 청산해야 합니다. 국힘당은 타협의 대상이
          아니라 해체 대상입니다. <br /> <br />
          <span>국민주권당</span>은 민주진보세력의 연대와 단결을 위해 헌신적으로
          노력해 가겠습니다. 진보·민주 진영이 상호존중하고 연대 단결하여 윤석열
          퇴진/국힘당 청산의 길로 뭉칠 수 있도록 하는 데 기여하겠습니다.
        </p>
      </ProfileTextContainer>
    </MyProfileContainer>
  );
}
