import { MyProfileContainer, ProfileTextContainer } from "./MyProfile.style";

export default function MyProfile() {
  return (
    <MyProfileContainer>
      <ProfileTextContainer>
        <span>국민이 이 나라의 주인입니다</span>
        <p>
          우리 국민들은 2016년, 2019년 그리고 작년과 올해의 촛불항쟁을 거치며
          주인으로서 자각을 높여왔습니다.
          <br />
          국민이 나라의 주인이자, 주권자로서 사회를 바꿀 힘이 있다는 것을
          확인했습니다. 국민들은 국민주권 의식을 높이 발휘하여 직접 나라의
          운명을 책임지고 사회 전반을 변화시키려 나서고 있습니다. 국민들은
          정치에서도 주인이 되고자 합니다. 정치인에게 맡겨두고 그저 따르는 것이
          아니라 국민이 주도하는 새로운 정치를 갈망하고 있습니다.
        </p>
        <br />
        <span>정치가 국민을 따라가지 못하고 있습니다</span>
        <p>
          우리 국민들은 기성 정치인들이 좋은 정치를 해주길 바라며 믿고 지지하고
          응원도 했습니다. 숱하게 청원도 해봤습니다. <br />
          하지만 기성 정치세력은 국민의 기대에 부응하는 정치를 하지 않았습니다.
          기성 정치권에 맡겨두고 청원하는 방식으로는 국민의 뜻을 실현할 수
          없다는 것이 날이 갈수록 뚜렷해지고 있습니다. 대한민국을 바꾸기 위해
          국민이 직접 촛불을 들고 박근혜 정권을 끌어내렸듯이, 정치를 바꾸기
          위해서는 결국 국민이 직접 정치의 주역이 되어야 합니다.
        </p>
        <br />
        <span>국민주권을 철저히 실현하는 국민주권당을 세우겠습니다</span>
        <p>
          1. 국민주권당은 대한민국 권력을 장악한 기득권세력의 반국민적 사대매국
          정치에 맞서 국민주권, 국민의 이익을 실현하기 위한 민주적이고 애국적인
          대중정당입니다.
          <br /> <br />
          2. 국민주권당은 수구기득권적폐의 청산과 철저한 민주개혁, 국익 우선의
          자주외교, 평화 번영 통일의 길로 일관되게 전진할 것입니다. 지옥 같은
          무한 경쟁과 약육강식, 극단적인 불평등 사회를 극복하고 ‘홍익인간’의
          정신으로 함께 사는 공동체를 추구합니다. 전 인류에게 닥친 기후위기를
          극복하며, 민주적이고 평화로운 국제질서를 세우는 데 적극 기여할
          것입니다.
          <br /> <br />
          3. 당내에 직접민주주의를 높은 수준에서 구현할 것입니다. 당대표부터
          평당원까지 누구나 동등하게 1인 1표의 권리를 가져야 합니다. 국회의원
          후보와 주요 당직자를 100% 당원 투표로 뽑을 것입니다. 당원이 직접
          정책을 발의하고 숙의, 토론을 거쳐 당의 정책을 결정하고 관철해나갈
          것입니다. 국회의원과 주요 당직자는 당과 당원의 통제 속에 혁신을
          제도화하여 기득권화되는 것을 철저히 방지할 것입니다.
        </p>
        <br />
        <span>
          당면하여 국민주권당은 윤석열 퇴진, 탄핵을 위해 총력을 기울일 것입니다
        </span>
        <p>
          윤석열 탄핵에 앞장서겠습니다. 윤석열 정권을 끝장내는 것이 모든 개혁의
          첫걸음입니다. 국힘당을 정계에서 퇴출시켜야 합니다. 국힘당은 협치의
          대상이 아니라 해체해야 할 대상입니다. 우리는 국힘당과 정치검찰,
          보수언론의 수구기득권동맹을 약화, 해체하기 위해 타협 없이
          싸우겠습니다. 국민주권당은 당리당략을 앞세우지 않고 전체
          진보·민주세력이 윤석열 퇴진, 반국힘당으로 뭉치도록 헌신하고
          노력하겠습니다.
        </p>
        <br />
        <span>주권자 국민의 정면돌파 정치를 시작합니다!</span>
        <p>
          한국 사회를 개혁하라는 국민의 요구와 열망은 대단히 높습니다. 그러나
          기득권의 눈치를 보며 에돌아가는 우유부단한 정치, 기득권세력 간
          타협하고 안주하는 낡은 정치풍토에서 국민의 개혁 열망은 현실로 꽃피지
          못하고 있습니다. 오늘의 국민주권 시대는 새로운 정치를 부릅니다. 답답한
          정치 현실을 주권자 국민의 직접정치로 정면돌파합시다! 모든 권력은
          국민으로부터 나옵니다. 자기 힘을 자각하고 하나로 뭉쳐 행동하는
          국민보다 강력한 힘은 없습니다. 특정한 사람들만의 정치가 아니라, 보통의
          국민이 정치의 주인이 되는 새로운 시대를 우리 손으로, 우리 힘으로
          열어냅시다!
        </p>
        <br />
        <br />
        <br />
        <span>2023년 6월 3일 (가칭) 국민주권당 추진위원회</span>
        <br />

        <span>(가칭) 국민주권당 추진위원 명단</span>
        <p>
          구태균(건설노동자), 권순욱(직장인), 권정남(자영업), 김종귀(변호사),
          김한봄(직장인), 문사라(요가 강사), 박대윤(웹디자이너), 박대중(의사),
          박수철(자영업), 박준의(촛불전진 운영위원장), 배서영(전 4.16연대
          사무처장), 백종성(직장인), 오관영(건설노동자), 오솔잎(줌바댄스 강사),
          오주성(전남대 전 총학생회장), 이명승(교육시민활동가), 이옥로(작가),
          이창국(전직 교사), 이해연(관광통역안내사), 이형구(「신제국주의의
          몰락」 저자), 임희용(중소기업 임원), 전경진(농업), 정녕희(중소기업인),
          정욱(자산관리사), 정이슬(인테리어디자이너), 정정희(직장인),
          정태남(직장인), 조만배(자영업), 조미학(자영농), 조하경(직장인),
          지철(의사), 한성(자영업)
        </p>
      </ProfileTextContainer>
    </MyProfileContainer>
  );
}
